package 面向对象.构造方法;

/*
    @Auther: exiashow
    @Date: 2025/3/25 20:42
    @Summary: 构造方法，也叫构造器/构造函数。 作用: 在创建对象的时候给成员变量进行赋值
*/
public class main {

    // 修饰符 类名(参数){
    //      方法体;
    // }

    /*
    特点:
        1.方法名与类型相同，大小写也要一致;
        2.没有返回值类型，连void都没有;
        3.没有具体的返回值（不能由return带回结果数据）
     */

//   Gemini的回复...
//    创建对象：
//    它就像一个“默认工厂”，用来创建这个类的基本对象。
//    初始化：
//    它在对象被创建时，给对象一些“默认值”。
//    没有参数：
//    它不需要任何额外的信息（参数）来创建对象。
//    默认存在：
//    如果你不写构造函数，Java 会自动给你一个“默认的空参构造函数”。
//    如果自己写了带参数的构造函数，那就需要自己写空参构造函数
//    如果你自己定义了带参数的构造函数，java就不会自动创建空参构造函数。

    // 推荐使用方式
    // 无论是否使用，都手动将无参和有参构造方法都协商
}
